
import 'package:hudo/utils/audio_controller.dart';
import 'package:hudo/utils/file_export.dart';
import 'package:shared_preferences/shared_preferences.dart';

class SavedArticlesArabic extends StatefulWidget {
  @override
  _SavedArticlesArabicState createState() => _SavedArticlesArabicState();
}

class _SavedArticlesArabicState extends State<SavedArticlesArabic> {
  GlobalKey<ScaffoldState> _drawerKey = GlobalKey();

  FocusNode fieldNode = FocusNode();
  String currentUserId = "default user id";

  final titles = [
    "المادة 1",
    "المادة 2",
    "المادة 3",
    "المادة 4",
    "المادة 5",
    "المادة 6",
    "المادة 7",
    "المادة 8",
    "المادة 9",
    "المادة 10",
    "المادة 11",
    "المادة 12",
    "المادة 13",
    "المادة 14",
    "المادة 15",
    "المادة 16",
    "المادة 17",
    "المادة 18",
    "المادة 19",
    "المادة 20",
    "المادة 21",
    "المادة 22",
    "المادة 23",
    "المادة 24",
    "المادة 25",
    "المادة 26",
    "المادة 27",
    "المادة 28",
    "المادة 29",
    "المادة 30"
  ];

  List Articles = [
    "يولد جميع الناس أحراراً ومتساوين في الكرامة والحقوق. وهم قد وهبوا العقل والوجدان وعليهم أن يعاملوا بعضهم بعضاً بروح الإخاء.",
    "لكلِّ إنسان حقُّ التمتُّع بجميع الحقوق والحرِّيات المذكورة في هذا الإعلان، دونما تمييز من أيِّ نوع، ولا سيما التمييز بسبب العنصر، أو اللون، أو الجنس، أو اللغة، أو الدِّين، أو الرأي سياسيًّا وغير سياسي، أو الأصل الوطني أو الاجتماعي، أو الثروة، أو المولد، أو أيِّ وضع آخر. وفضلاً عن ذلك لا يجوز التمييزُ علي أساس الوضع السياسي أو القانوني أو الدولي للبلد أو الإقليم الذي ينتمي إليه الشخص، سواء أكان مستقلاًّ أو موضوعًا تحت الوصاية أو غير متمتِّع بالحكم الذاتي أم خاضعًا لأيِّ قيد آخر على سيادته.",
    "لكلِّ فرد الحقُّ في الحياة والحرِّية وفي الأمان على شخصه.",
    "لا يجوز استرقاقُ أحد أو استعبادُه، ويُحظر الرق والاتجار بالرقيق بجميع صورهما.",
    "لا يجوز إخضاعُ أحد للتعذيب ولا للمعاملة أو العقوبة القاسية أو اللاإنسانية أو الحاطَّة بالكرامة.",
    "لكلِّ إنسان، في كلِّ مكان، الحقُّ بأن يُعترَف له بالشخصية القانونية.",
    "الناسُ جميعًا سواءٌ أمام القانون، وهم يتساوون في حقِّ التمتُّع بحماية القانون دونما تمييز، كما يتساوون في حقِّ التمتُّع بالحماية من أيِّ تمييز ينتهك هذا الإعلانَ ومن أيِّ تحريض على مثل هذا التمييز.",
    "لكلِّ شخص حقُّ اللجوء إلى المحاكم الوطنية المختصَّة لإنصافه الفعلي من أيَّة أعمال تَنتهك الحقوقَ الأساسيةَ التي يمنحها إيَّاه الدستورُ أو القانونُ.",
    "لا يجوز اعتقالُ أيِّ إنسان أو حجزُه أو نفيُه تعسُّفًا.",
    "لكلِّ إنسان، على قدم المساواة التامة مع الآخرين، الحقُّ في أن تَنظر قضيتَه محكمةٌ مستقلَّةٌ ومحايدةٌ، نظرًا مُنصفًا وعلنيًّا، للفصل في حقوقه والتزاماته وفى أيَّة تهمة جزائية تُوجَّه إليه.",
    "أ .كُّل شخص مَّتهم بجريمة ُيعتَبر بريًئا إلى أن يثبت ارتكاُبه لها قانوًنا في محاكمة علنية تكون قد ُوِّفرت له فيها جميُع الضمانات اللازمة للدفاع عن نفسه.\nب.  لا ُيدان أ ُّي شخص بجريمة بسبب أ ِّي عمل أو امتناع عن عمل لم يكن في حينه يشِّكل جرًما بمقتضى القانون الوطني أو الدولي، كما لا ُتوَقع عليه أَّيُة عقوبة أشَّد من تلك التي كانت ساريًة في الوقت الذي ارُتكب فيه الفعل الجُرمي.",
    "لا يجوز تعريضُ أحد لتدخُّل تعسُّفي في حياته الخاصة أو في شؤون أسرته أو مسكنه أو مراسلاته، ولا لحملات تمسُّ شرفه وسمعته. ولكلِّ شخص حقٌّ في أن يحميه القانونُ من مثل ذلك التدخُّل أو تلك الحملات. ",
    "أ. لكِّل فرد حٌّق في حِّرية التنُّقل وفي اختيار محِّل إقامته داخل حدود الدولة.\nب. لكِّل فرد حٌّق في مغادرة أ ِّي بلد، بما في ذلك بلده، وفي العودة إلى بلده.",
    "أ. لكِّل فرد حُّق التماس ملجأ في بلدان أخرى والتمُّتع به خلا ًصا من الاضطهاد.\nب. لا يمكن التذُّرُع بهذاالحِّق إذا كانت هناك ٌملاحقة ٌناشئة بالفعل عن جريمة غير سياسية أو عن أعمال تناقض مقاصَد الأمم المتحدة ومبادئها.",
    "أ. لكل فرد حق التمتع بجنسية ما.\nب. لا يجوز، تعسُّفًا، حرمانُ أيِّ شخص من جنسيته ولا من حقِّه في تغيير جنسيته.",
    "أ. للرجل والمرأة، متى أدركا سنَّ البلوغ، حقُّ التزوُّج وتأسيس أسرة، دون أيِّ قيد بسبب العِرق أو الجنسية أو الدِّين. وهما متساويان في الحقوق لدى التزوُّج وخلال قيام الزواج ولدى انحلاله.\nب. لا يُعقَد الزواجُ إلاَّ برضا الطرفين المزمع زواجهما رضاءً كاملً لا إكراهَ فيه.\nت. الأسرةُ هي الخليةُ الطبيعيةُ والأساسيةُ في المجتمع، ولها حقُّ التمتُّع بحماية المجتمع والدولة.",
    "أ. لكلِّ فرد حقٌّ في التملُّك، بمفرده أو بالاشتراك مع غيره.\nب. اليجوز تجريدُ أحدٍ من مُلكه تعسُّفًا.",
    "لكلِّ شخص حقٌّ في حرِّية الفكر والوجدان والدِّين، ويشمل هذا الحقُّ حرِّيته في تغيير دينه أو معتقده، وحرِّيته في إظهار دينه أو معتقده بالتعبُّد وإقامة الشعائر والممارسة والتعليم، بمفرده أو مع جماعة، وأمام الملأ أو على حدة.",
    "لكلِّ شخص حقُّ التمتُّع بحرِّية الرأي والتعبير، ويشمل هذا الحقُّ حرِّيته في اعتناق الآراء دون مضايقة، وفي التماس الأنباء والأفكار وتلقِّيها ونقلها إلى الآخرين، بأيَّة وسيلة ودونما اعتبار للحدود.",
    "أ. لكلِّ شخص حقٌّ في حرِّية الاشتراك في الاجتماعات والجمعيات السلمية.\nب. لا يجوز إرغامُ أحدٍ على الانتماء إلى جمعية ما.",
    "أ. لكِّل شخص حُّق المشاركة في إدارة الشؤون العامة لبلده، إ َّما ًمباشرة وإ َّما بواسطة ممِّثلين يختارون في حِّرية.\nب. لكِّل شخص، بالتساوي مع الآخرين، حق تقلد الوظائف العا َّمة في بلده.\nت. إراد ُة الشعب هي مناُط سلطة الحكم ، ويجب أن تتجلَّى هذه الإرادة من خلال انتخابات نزيهة تجرى دورًّيا بالاقتراع العام وعلى قدم المساواة بين الناخبين وبالتصويت السرِّي أو بإجراء مكافئ من حيث ضمان حرِّية التصويت. ",
    "لكلِّ شخص، بوصفه عضوًا في المجتمع، حقٌّ في الضمان الاجتماعي، ومن حقِّه أن تُوفَّر له، من خلال المجهود القومي والتعاون الدولي، وبما يتَّفق مع هيكل كلِّ دولة ومواردها، الحقوقُ الاقتصاديةُ والاجتماعيةُ والثقافيةُ التي لا غنى عنها لكرامته ولتنامي شخصيته في حرِّية.",
    "أ. لكِّل شخص حُّق العمل، وفي حِّرية اختيار عمله، وفي شروط عمل عادلة وُمرضية، وفي الحماية من البطالة.\nب. لجميع الأفراد ، دون أي تمييز ، الحُّق في أ ٍجر متساٍو على العمل المتساوي.\nت. لكِّل فرد يعمل حٌّق في مكافأة عادلة وُمرضية تكفل له ولأسرته عيشًة لائقًة بالكرامة البشرية، وُتستكَمل، عند الاقتضاء، بوسائل أخرى للحماية الاجتماعية.\nث. لكِّل شخص حُّق إنشاء النقابات مع آخرين والانضمام إليها من أجل حماية مصالحه.",
    "لكِّل شخص حٌّق في الراحة وأوقات الفراغ، وخصوصًا في تحديد معقول لساعات العمل وفي إجازات دورية مأجورة.",
    "أ. لكِّل شخص حٌّق في مستوى معيشة يكفي لضمان الصحة والرفاهة له ولأسرته،وخاصَّةً على صعيد المأكل والملبس والمسكن والعناية الطبية وصعيد الخدمات الاجتماعية الضرورية، وله الحقُّ في ما يأمن به الغوائل في حالات البطالة أو المرض أو العجز أو الترمُّل أو الشيخوخة أو غير ذلك من الظروف الخارجة عن إرادته والتي تفقده أسباب عيشه.\nب. للأمومة والطفولة حٌّق في رعاية ومساعدة خاصَّتين. ولجميع الأطفال حُّق التمُّتع بذات الحماية الاجتماعية سواء ُولدوا في إطار الزواج أو خارج هذا الإطار.",
    "أ. لكِّل شخص حٌّق في التعليم. ويجب أن ُيوَّفر التعليم مَّجاًنا، على الأقل في مرحلتيه الابتدائية والأساسية. ويكون التعليمُ الابتدائيُّ إلزاميًّا. ويكون التعليمُ الفنِّي والمهني متاحًا للعموم. ويكون التعليمُ العالي مُتاحًا للجميع تبعًا لكفاءتهم.\nب. يجب أن يستهدف التعليمُ التنميةَ الكاملةَ لشخصية الإنسان وتعزيز احترام حقوق الإنسان والحريات الأساسية. كما يجب أن يعزِّز التفاهمَ والتسامحَ والصداقةَ بين جميع الأمم وجميع الفئات العنصرية أو الدينية، وأن يؤيِّد الأنشطةَ التي تضطلع بها الأممُ المتحدةُ لحفظ السلام.\nت. للآباء، على سبيل الأولوية، حُّق اختيار نوع التعليم الذي ُيعطى لأولادهم.",
    "أ. لكِّل شخص حُّق المشاركة الحَّرة في حياة المجتمع الثقافية، وفي الاستمتاع بالفنون ،والإسهام في التقدم العلمي وفي الفوائد التي تنجم عنه.\nب. لكِّل شخص حٌّق في حماية المصالح المعنوية والمادية المترِّتبة على أ ِّي إنتاج علمي أو أدبي أو فنِّي من صنعه.",
    "لكلِّ فرد حقُّ التمتُّع بنظام اجتماعي ودولي يمكن أن تتحقَّق في ظلِّه الحقوق والحريات المنصوص عليها في هذا الإعلان تحقُّقًا تامًّا.",
    "أ. على كِّل فرد واجباٌت إزاء الجماعة، التي فيها وحدها يمكن أن تنمو شخصيته النمو الحر الكامل.\nب. لا ُيخضع أُّي فرد، في ممارسة حقوقه وحِّرياته، َّإلا للقيود التي يقِّررها القانوُن مستهدًفا منها، حصًرا، ضماَن الاعتراف الواجب بحقوق وحِّريات الآخرين واحترامها، والوفاَء بالعادل من مقتضيات الفضيلة والنظام العام ورفاه الجميع في مجتمع ديمقراطي.\nت. لا يجوز في أيِّ حال أن تُمارَس هذه الحقوقُ على نحو يناقض مقاصدَ الأمم المتحدة ومبادئها.",
    "ليس في هذا الإعلان أيُّ نصٍّ يجوز تأويله على نحو يفيد انطواءه على تخويل أيَّة دولة أو جماعة، أو أيِّ فرد، أيَّ حقٍّ في القيام بأيِّ نشاط أو بأيِّ فعل يهدف إلى هدم أيٍّ من الحقوق والحرِّيات المنصوص عليها فيه."
  ];

  @override
  void initState() {
    getSaveId();
    super.initState();
  }

  getSaveId() async {
    SharedPreferences prefs = await SharedPreferences.getInstance();
    prefs.getString("id");
    setState(() {
      currentUserId = prefs.getString("id");
    });
    print("current User Id is ${currentUserId}");
  }

  unSaveArticle() async {
    // await DioHelper.init();
    // DioHelper.postData(url: 'artical_unsave/${"lamyaa6"}/1')
    //     .then((value) async {
    //   print("unsave Article  atatus code  ${value.statusCode}");
    //   print(" unsave Article response is : ${value.data}");
    // }).catchError((error) {
    //   print(error);
    // });
  }

  bool isPlayerOpened = false;
  int indexNo = 0;

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Saved Articles'),
      ),
      body: ListView.builder(
          itemCount: Articles.length,
          itemBuilder: (context, index) {
            return GestureDetector(
              onTap: () {
                this.indexNo = index;
              },
              child: Card(
                child: Container(
                  padding: EdgeInsets.all(10),
                  child: ExpansionTile(
                      title: Text(titles[index],style: TextStyle(color: Colors.black),),
                      children: [
                        ListTile(
                          subtitle: Text(
                            Articles[index],
                            style: TextStyle(
                              color: Colors.black,
                            ),
                            softWrap: true,
                            textDirection: TextDirection.rtl,
                            // textAlign: TextAlign.right,
                          ),
                          trailing: IconButton(
                            icon: Icon(Icons.play_arrow),
                            onPressed: () {
                              setState(() {
                                isPlayerOpened = true;
                                this.indexNo = index;
                              });
                              floatingActionItem;
                            },
                          ),
                          // style: TextStyle(
                          //   color: index.isEven ? Colors.white : Colors.green,
                          // ),
                        )
                      ]
                  ),
                ),
                color: index.isEven ? Colors.white70 : Colors.blue,
              ),
            );
          }),
      floatingActionButton: floatingActionItem,
    );
//      drawer: SettingsDrawer(node: fieldNode,)
  }

  onPaused() {
    setState(() {
      isPlayerOpened = false;
    });
  }

  get floatingActionItem {
    Widget floatingPlayer = FloatingAudioPlayer(
      onPaused: onPaused,
      index: indexNo,
      lang: 'arabic',
    );

    Widget floatingActionButton = FloatingActionButton(
      onPressed: () {
        setState(() {
          isPlayerOpened = true;
        });
      },
      child: Icon(Icons.play_arrow_outlined),
    );

    return AnimatedSwitcher(
      reverseDuration: Duration(milliseconds: 0),
      duration: const Duration(milliseconds: 200),
      transitionBuilder: (Widget child, Animation<double> animation) {
        return ScaleTransition(child: child, scale: animation);
      },
      child: isPlayerOpened ? floatingPlayer : floatingActionButton,
    );
  }
}
