{
  "---------------------------------- intro ---------------------------": "-----------------------------------------",
  "Together We Can": "معاً نستطيع",
  "Who we Are?": "من نحن",
  "Who we Are details": "هودو هي منظمة لحقوق الإنسان والتنمية ،مستقلة ،غير حكومية،غير ربحية. محصورة في ترقية الإنسان ،بناء السلام والتنمية .",
  "Our Vision": "ماذا نفعل",
  "Our Vision details": "يرتكز عمل هودو على حماية حقوق الإنسان وترقيتها ،وبشكل خاص في مراقبة وضع حقوق الإنسان والإنتهاكلت التي تُرتكب في حق مواطني مناطق الصراع (جبال النوبة والنيل الأزرق )",
  "Our Mission": "شاركنا",
  "Our Mission details": "هناك عدة طرق للمساعدة ، لذا لا تتردد لوقف انتهاكات حقوق الإنسان . قم بالإتصال بأعضاء وأنصارالمنظمة لوضع الضغط على الحكومات ، الشركات والمنظومة الدولية .",

  "---------------------------------- home ---------------------------": "-----------------------------------------",
  "Continue": "استمرار",
  "Universal Declaration of Human Rights1": "الإعلان العالمي لحقوق الإنسان",
  "Settings": "الإعدادات",
  "Saved Articles": "البنود المحفوظة",
  "Change Language": "تغيير اللغة",
  "Share The App": "مشاركة التطبيق",
  "About Hudo": "عن المنظمة",
  "Contact Us": "تواصل معنا",
  "Version": "الإصدار",
  "Article": "بند",
  "We are all born free and equal": "لقد ولدنا جميعاً أحراراً ومتساوين",
  "Article 1 details": "الإعلان العالمي لحقوق الإنسان لعام 1948وثيقة حول حقوق الإنسان: لقد ولدنا جميعًا أحرارًا ومتساوين. الإعلان العالمي لحقوق الإنسان لعام 1948 هو - من الواضح - وثيقة حول حقوق الإنسان. فلماذا يتم إدراج الكرامة قبل الحقوق في المادة1؟ الكرامة هي أساس جميع حقوق الإنسان. البشر لهم حقوق ويجب معاملتهم بحذر شديد ، على وجه التحديد لأن كل فرد يمتلك قيمة جوهرية. وقد أطلق رئيس حقوق الإنسان السابق في الأمم المتحدة ، زيد رعد الحسين ، على هذه الكلمات الافتتاحي ربما الكلمات الأكثر رنانًا وجمالًا في أي اتفاقية دولية . ويشددون على أن حقوق الإنسان ليست مكافأة على السلوك الجيد ، على حد تعبيره ، ولكنها استحقاق لجميع الناس في جميع الأوقات وفي جميع الأماكن الإسبانية المادة 1: لقد ولدنا جميعًا أحرارًا ومتساوين. الحقوق (الإعلان العالمي لحقوق الإنسان) هي - من الواضح - وثيقة عن حقوق الإنسان. فلماذا يتم إدراج الكرامة قبل الحقوق في المادة 1؟ الكرامة هي أساس جميع حقوق الإنسان. البشر لهم حقوق ، ويجب معاملتهم بعناية فائقة ، لأن كل واحد منهم يمتلك المرء قيمة جوهرية ، وقد أطلق رئيس حقوق الإنسان السابق في الأمم المتحدة ، زيد رعد الحسين ، على هذه الكلمات الافتتاحية ربما الكلمات الأكثر رنانًا وجمالًا في أي اتفاقية دولية. ويشددون على أن حقوق الإنسان ليست مكافأة على السلوك الجيد ، على حد تعبيره ، بل هي استحقاق لجميع الناس في جميع الأوقات وفي جميع الأماكن. وردًا على أهوال الحربين العالميتين ، اعتقد المجتمع الدولي أنها مهمة في عام 1948 للتأكيد على مفهوم الكرامة الإنسانية في الكلمات الأولى من هذه الوثيقة الرائدة ، مع التأكيد على مصطلح تم تسليط الضوء عليه بالفعل في السطر الافتتاحي للإعلان العالمي لحقوق الإنسان",
  "Choose Language": "اختر اللغة",
  "Arabic": "اللغة العربية",
  "English": "اللغة الإنجليزية",
  "Turkish": "اللغة التركية",
  "French": "اللغة الفرنسية",
  "Russian": "اللغة الروسية",
  "Italian": "اللغة الإيطالية",
  "German": "اللغة الألمانية",
  "Portuguese": "اللغة البرتغالية",
  "Name": "الاسم",
  "Email": "البريد الإلكتروني",
  "Write your message": "اكتب رسالتك",
  "Send": "إرسال",
  "Done": "تم",
  "Your message has been sent successfully !": "تم إرسال رسالتك بنجاح",
  "Close": "إغلاق",
  "Home": "الرئيسية",
  "Remove": "إزالة",
  "Hudo Center": "مركز هودو",
  "about details":"منظمة حقوق الإنسان والتنمية (هودو)معاُ نستطيع!من نحن؟؟؟منظمة حقوق الإنسان والتميه (HUDO) مستقله، غير حكوميه، غير حزبيه ومنظمه غير ربحيه، محصوره في ترقية وحماية حقوق الإنسان, بناء السلام والتنميه. لقد أنشأت لتقدم خدماتها في ولاية جنوب كردفان بالسودان, سجلت بالمفوضية المشتركه للعون الإنساني بالولايه (HAC/SRRC) في 25 أكتوبر 2009م وعرفت بذلك كمنظمه طوعيه غير حكوميه (آخر تجديد كان في 13 فبراير 2011م – حيث يجدد سنوياً ويسري لمدة عام). في يونيو 2011م عند إندلاع النزاع في جنوب كردفان أقفلت (HUDO) وأُلغي ترخيصها بواسطة السلطات السودانيه، وعلي الرغم من ذلك ظلت تعمل في ظروف ضاغطه وخطره. ولكي تواصل رسالتها إنتقلت (HUDO) لدولة يوغندا وسجلت رسمياً تحت نفس الإسم. كما توسع عملها ليشمل كل السودان واللاجئين السودانيين بيوغندا وجنوب السودان. (HUDO) ملتزمةً تماماً بتحقيق التنميه المستدامه, ترقية وسعادة الإنسان بعيداً عن التمييز العنصري، الديني، النوعي أو السياسي. (HUDO) منظمه حقوقيه تعمل بمبدأ مكونين (مادي وحسي) في كل برامجها وأنشطتها من حيث التصميم أو التنفيذ, بحيث المكون المادي هو الأنشطه المنفذه يتخللها الحسي الذي يمثله بعد الحق الإنساني. بغض النظر سواء أكان البرنامج المنفذ تنموي, إعادة بناء أو إغاثي. فالبعد الحسي الإنساني الذي هو دعامة المنظمه أكثر وضوحاً وتركيزاً في كشف الجذور المسببه. أما النشاطات المرتبطه بحقوق الإنسان تتمثل في الحمايه، بناء السلام، النشاط الإجتماعي والنفسي، رفع الوعي - تقوية وتنظيم المجتمعات حتي يمكنها ذلك من المشاركه بإيجابيه وفعاليه للإرتقاء بوضع حقوق الإنسان.أين نعمل؟؟؟سجلت المنظمة بدولة يوغندا تحت نفس المسمى كشركه غير ربحيه في يوم 13 مارس 2013م. كما تم تسجيلها بدولة جنوب السودان كمنظمه طوعيه في يوم.......... مما جعل (HUDO) حاضرةً بالدولتين. مع عملها بفعاليه في مراقبة أوضاع حقوق الإنسان بالسودان.ماذا نفعل؟؟؟يتركز عمل (HUDO) في حماية حقوِق الإنسان وترقيتها, وبشكل خاص في مراقبة وضع حقوق الإنسان والإنتهاكات التي ترتكب في حق مواطني مناطق الصراع (جبال النوبه والنيل الأزرق) بمن فيهم النازحين منهم بكل بقاع السودان, كما اللاجئين بيوغندا وجنوب السودان."
}


