{
  "---------------------------------- intro ---------------------------": "-----------------------------------------",
  "Together We Can": "Together We Can",
  "Who we Are?": "Who we Are?",
  "Who we Are details": "(HUDO) Centre  is an independent, non-government, non-partisan and non-profit Sudanese organization dedicated to the promotion and protection of human rights, peace building and development.",
  "Our Vision": "Our Vision",
  "Our Vision details": "A world where everyone’s human rights are protected and fulfilled without discrimination",
  "Our Mission": "Our Mission",
  "Our Mission details": "To champion universal access to rights based information and services to vulnerable and underserved communities’ through sustainable innovations, humanitarian support, strategic partnerships, rights empowerment, capacity building, research and advocacy.",
  "---------------------------------- home ---------------------------": "-----------------------------------------",
  "Continue": "Continue",
  "Universal Declaration of Human Rights1": "Universal Declaration of Human Rights",
  "Settings": "Settings",
  "Saved Articles": "Saved Articles",
  "Change Language": "Change Language",
  "Share The App": "Share The App",
  "About Hudo": "About Hudo",
  "Contact Us": "Contact Us",
  "Version": "Version",
  "Article": "Article",
  "We are all born free and equal": "We are all born free and equal",
  "Article 1 details": "The 1948 Universal Declaration of Human Rights (UDHR) is\" a document about human rights. So why is dignity listed before rights in Article 1 SpanishArticle \"\"1: We are all born free and equal The 1948 Universal Declaration of Human Rights (UDHR) is – obviously – a document about human rights. So why is dignity listed before rights in Article 1?Dignity is the foundation of all human rights. Human beings have rights, and should be treated with utmost care, precisely because each one possesses intrinsic worth. Former UN rights chief Zeid Ra’ad Al Hussein called these opening words “perhaps the most resonant and beautiful words of any international agreement.” They underline that “human rights are not a reward for good behavior,” as he put it, but the entitlement of all people at all times and in all places.SpanishArticle 1: We are all born free and equalThe 1948 Universal Declaration of Human Rights (UDHR) is – obviously – a document about human rights.So why is dignity listed before rights in Article 1?Dignity is the foundation of all human rights. Human beings have rights, and should be treated with utmost care, precisely because each one possesses intrinsic worth. Former UN rights chief Zeid Ra’ad Al Hussein called these opening words “perhaps the most resonant and beautiful words of any international agreement.” They underline that “human rights are not a reward for good behavior,” as he put it, but the entitlement of all people at all times and in all places.Reacting to the horror of the two World Wars, the international community thought it important in 1948 to emphasize the concept of human dignity in the very first words of this groundbreaking document, underlining a term that was already highlighted in the opening line of the UDHR’s",
  "Choose Language": "Choose Language",
  "Arabic": "Arabic",
  "English": "English",
  "Turkish": "Turkish",
  "French": "French",
  "Russian": "Russian",
  "Italian": "Italian",
  "German": "German",
  "Portuguese": "Portuguese",
  "Name": "Name",
  "Email": "Email",
  "Write your message": "Write your message",
  "Send": "Send",
  "Done": "Done",
  "Your message has been sent successfully !": "Your message sent successfully",
  "Close": "Close",
  "Home": "Home",
  "Remove": "Remove",
  "Hudo Center": "Hudo Center",
  "about details":"Human rights and development Organization (HUDO)Together we can!who are we???human rights and development Organization (HUDO) is an independent, non-governmental, non-partisan and non-profit organization, dedicated to the promotion and protection of human rights,peace building and development. It was established to provide its services in the state of South Kordofan in Sudan. It was registered with the state’s Joint Humanitarian Aid Commission (HAC/SRRC) on October 25, 2009 AD and was known as a voluntary non-governmental organization (the last renewal was on February 13, 2011 AD - where it is renewed annually and valid for one year). In June 2011, when the conflict broke out in South Kordofan, HUDO was closed and its license was revoked by the Sudanese authorities. Despite that, it continued to operate in stressful and dangerous conditions. In order to continue its mission, HUDO moved to Uganda and officially registered under the same name. It also expanded its work to include all of Sudan and Sudanese refugees in Uganda and South Sudan(HUDO) is fully committed to achieving sustainable development, promotion and human happiness away from racial, religious, gender or political discrimination. (HUDO) is a human rights organization that operates on the principle of two components (physical and sensory) in all its programs and activities in terms of design or implementation, so that the physical component is the implemented activities interspersed with the sensory that represents the dimension of the human right. Regardless of whether the program implemented is developmental, rebuilding or relief. The human sensory dimension, which is the pillar of the organization, is more clear and focused in revealing the causative roots. As for the activities related to human rights, they are protection, peace building, social and psychological activism, raising awareness - strengthening and organizing societies so that they can participate positively and effectively to improve the human rights situation.Where do you work???The organization was registered in Uganda under the same name as a non-profit company on March 13, 2013. It was also registered in the State of South Sudan as a voluntary organization on …………., which made (HUDO) present in both countries. With its effective work in monitoring the human rights situation in Sudan.What do we do???HUDO's work is focused on protecting and promoting human rights, in particular in monitoring the human rights situation and violations committed against the citizens of conflict areas (the Nuba Mountains and Blue Nile), including the displaced in all parts of Sudan, as well as the refugees in Uganda and South Sudan."


}



